# Translation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..Translation Property
Transform1D Class See Also
---
The translational part of this transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double Translation { get; set; }
```

Visual Basic
---
```text
Public Property Translation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Translation {
	double get ();
	void set (double value);
}
```

# See Also
Transform1D Class
Autodesk.Revit.DB Namespace